/*-----------------------------------------------------------------------------
			24.07.2001 API МПК-1 v 1.2.1

				Основной модуль
				---------------

 ------------------------------------------------------------------------------
Автор: Лукичев А.Н.

Изменения:
-------- ------ ----------- --------------------------------------------------- 
 Дата	Версия	Автор				Описание
-------- ------ ----------- --------------------------------------------------- 
18.08.01 1.1
20.08.01 1.2.1  Ключев А.О. Смена версии

-----------------------------------------------------------------------------*/

int DataSeg;	// НЕ УБИРАТЬ! Переменная DataSeg необходима для
		// обеспечения нормальной работы StartUp


#include "186es.h"
#include "mpkdefs.h"
#include "low.h"
#include "sio.h"
#include "modem.h"
#include "serial.h"
#include "error.h"
#include "net.h"
#include "i2c.h"
#include "eeprom.h"
#include "common.h"
#include "timer.h"
#include "time.h"
#include "print.h"

// Тесты
extern void test(void);

void main()
{

	test();
}

