/* ****************************************************************************

	24.07.2001 API МПК-1 v 1.2.2

 	Функции для работы с модемом
	----------------------------

extern BYTE GetModemSignal(void);	// Чтение модемных сигналов
extern void SetDTR(BYTE DTR);           // Установка модемных сигналов
extern void SendModemString(CPTR initstring);
					// Запись строки инициализации в модем
extern BYTE Rsio(void);			// Чтение байта из модема
extern WORD RsioStat(void);		// Проверка готовности байта от модема.
extern void PurgeModem(void);		// Очистка входного буфера модема 
extern void Wsio(BYTE c);		// Передача байта модему.
extern WORD WsioStat(void);		// Готовность модема для приема байта от контроллера.

 ------------------------------------------------------------------------------
Автор: Лукичев А.Н.

Изменения:
-------- ------ ----------- --------------------------------------------------- 
 Дата	Версия	Автор				Описание
-------- ------ ----------- --------------------------------------------------- 
18.08.01 1.1	Изменена логика работы модемных функций в соответствии с новым	
                набором режимов работы последовательного канала (MODEM, RS232,
                RS485)                                                        
20.08.01 1.2.1  Ключев А.О. Смена версии
22.08.01 1.2.2	Лукичев А.Н. Корректировки (RS485)
 **************************************************************************** */

#include "186es.h"
#include "mpkdefs.h"
#include "sio.h"
#include "low.h"
#include "error.h"
#include "serial.h"
#include "common.h"
#include "modem.h"
#include "timer.h"

volatile WORD Timeout=0;
volatile BYTE ri=0;//Флаг перепада линии #RI в активное состояние, сбрасывается
		//при обращении к функции GetModemSignal

/* ----------------------------------------------------------------------------
			      GetModemSignal
 ----------------------------------------------------------------------------
Чтение модемных сигналов

Результат	Информация о модемных сигналах:
		Бит 2 - состояние сигнала DSR
		Бит 1 - состояние сигнала DCD
		Бит 0 - состояние сигнала RI
Входные параметры	Нет

Описание

Функция возвращает значение модемных сигналов
  ---------------------------------------------------------------------------- */
BYTE GetModemSignal(void)
{
BYTE r;
	if(!(sio_mode&SIO_DEBUG))
		if(!((sio_mode&MCNF) && !(sio_mode&RS485))){//Если не режим MODEM
			AddComError(COM0,1,ERROR_COM_MODE);
			return 0;
			}
		
	r=(BYTE)(inpw(P1DATA)>>13);
	__asm {cli};
	if(ri) {r |= 1; ri = 0;}
	__asm {sti};
	return r;
}

/* ----------------------------------------------------------------------------
		         SetDTR
 ----------------------------------------------------------------------------
Установка модемных сигналов

Результат	Нет
Входные параметры	

DTR		0 - установить DTR в пассивное состояние
		1 - установить DTR  в активное состояние
Описание

Функция позволяет управлять сигналом DTR
  ---------------------------------------------------------------------------- */
extern void Blink(long);//!!!
void SetDTR(BYTE DTR) 
{
WORD r;
if(!(sio_mode&SIO_DEBUG))
	if(!((sio_mode&MCNF) && !(sio_mode&RS485))){//Если не режим MODEM
		AddComError(COM0,1,ERROR_COM_MODE);
		return;
		}

	__asm {cli};
	r = inpw(P1DATA);
	if ( DTR )
		outpw(P1DATA,r&0xE7F7);//+сброс 2х линий i2c
	else
		outpw(P1DATA,(r&~0x1800)|0x0008);//+сброс 2х линий i2c
	__asm {sti};
}

/* ----------------------------------------------------------------------------
                 SendModemString
 ----------------------------------------------------------------------------
Запись строки инициализации в модем

Результат	Нет
Входные параметры	

Initstring	ASCIIZ строка с AT командами

Описание
Функция позволяет записать в модем последовательность AT команд
  ---------------------------------------------------------------------------- */

void SendModemString(CPTR initstring)
{
if(!(sio_mode&SIO_DEBUG))
	if(!((sio_mode&MCNF) && !(sio_mode&RS485))){//Если не режим MODEM
		AddComError(COM0,1,ERROR_COM_MODE);
		return;
		}
	while ( *initstring )
		Wsio(*initstring++);
}


/* ----------------------------------------------------------------------------
         		Rsio
 ----------------------------------------------------------------------------
Чтение байта из модема

Результат	прочитанный из модема байт

Входные параметры	Нет

Описание
Функция предназначена для чтения байта из модема. 
Принятые от модема байты буферизируются. 
Функция Rsio() блокируется, если входной буфер пуст. 
Проверить наличие байта в модеме можно с помощью функции RsioStat();
  ---------------------------------------------------------------------------- */

BYTE Rsio(void)
{
	BYTE c;
	WORD time_out;
if(!(sio_mode&SIO_DEBUG))
	if(!((sio_mode&MCNF) && !(sio_mode&RS485))){//Если не режим MODEM
		AddComError(COM0,1,ERROR_COM_MODE);
		return 0;
		}

	if(!(sio_mode&SER)){ //Если до вызова этой функции передавались 
				//пакеты
		//PurgeModem();
		__asm {cli};
		rCount = tCount = 0;
		__asm {sti};
		while(transmitting)ResetWDT();
		sio_mode|=SER;
		}

	time_out = SystemTime;//Текущее значение системного счетчика
	while ( !rCount ) {
		if((SystemTime-time_out)>=Timeout){
			AddComError(COM0,1,ERROR_COM_TIMEOUT);
			return 0;
			}
		ResetWDT(); 
		}
	__asm {cli};
	c = rBuf[rStart&rMASK];
	++rStart;
	--rCount;
	if( !rCount ) {
		outpw(SP0CT,inpw(SP0CT)|0x80);
		//Разрешение прерывания на прием после полной очистки буфера
		}
	__asm {sti};
	return c;
}


/* ----------------------------------------------------------------------------
         		RsioStat
 ----------------------------------------------------------------------------
Проверка готовности байта от модема.

Результат		Количество байтов в приемном буфере
Входные параметры	Нет

Описание
Функция сообщает прикладной программе о готовности выдать из буфера очередного байта, принятого от модема.

  ---------------------------------------------------------------------------- */

WORD RsioStat(void)
{
if(!(sio_mode&SIO_DEBUG))
	if(!((sio_mode&MCNF) && !(sio_mode&RS485))){//Если не режим MODEM
		AddComError(COM0,1,ERROR_COM_MODE);
		return 0;
		}

	if(!(sio_mode&SER)){ //Если до вызова этой функции передавались 
				//пакеты
		//PurgeModem();
		__asm {cli};
		rCount = tCount = 0;
		__asm {sti};
		while(transmitting)ResetWDT();
		sio_mode|=SER;
		}

	return rCount;
}


/* ----------------------------------------------------------------------------
         		PurgeModem
 ----------------------------------------------------------------------------
Очистка входного буфера модема 

Результат		Нет
Входные параметры	Нет

Описание
Функция удаляет из входного и выходного буфера все полученные от модема байты.

  ---------------------------------------------------------------------------- */

void PurgeModem(void)
{
WORD w;
if(!(sio_mode&SIO_DEBUG))
	if(!((sio_mode&MCNF) && !(sio_mode&RS485))){//Если не режим MODEM
		AddComError(COM0,1,ERROR_COM_MODE);
		return;
		}

	__asm {cli};
	rCount = tCount = 0;
	transmitting = 0;
	w = inpw(SP0CT);
	outpw(SP0CT,w & ~0x140);// остановка передачи (+запрет прерывания)
	outpw(SP0CT,w | 0x40);// разрешение передачи
	__asm {sti};
}


/* ----------------------------------------------------------------------------
         		Wsio
 ----------------------------------------------------------------------------
Передача байта модему.

Результат		Нет

Входные параметры	

С			передаваемый байт

Описание
Функция предназначена для передачи одного байта модему. Передаваемые байты буферизируются. Функция Wsio() блокируется, если выходной буфер переполнен. Проверить наличие свободного места в буфере можно с помощью функции WsioStat();
  ---------------------------------------------------------------------------- */
void Wsio(BYTE c)
{
  while( !(inpw(SP0STS) & 0x0040) )
  {
    ResetWDT();
  }
  outpw( SP0TD, (BYTE)c );
}

/* ----------------------------------------------------------------------------
         		WsioStat
 ----------------------------------------------------------------------------
Готовность модема для приема байта от контроллера.

Результат		Количество свободных байтов в буфере передачи.
Входные параметры	Нет

Описание
Функция сообщает прикладной программе о готовности модема 
к приему от контроллера очередного байта.
  ---------------------------------------------------------------------------- */
WORD WsioStat(void)
{
if(!(sio_mode&SIO_DEBUG))
	if(!((sio_mode&MCNF) && !(sio_mode&RS485))){//Если не режим MODEM
		AddComError(COM0,1,ERROR_COM_MODE);
		return 0;
		}
	if(!(sio_mode&SER)){ //Если до вызова этой функции передавались 
				//пакеты
		while(transmitting)ResetWDT();
		PurgeModem();
		sio_mode|=SER;
		}


	return tMAX-tCount;
}

/*---------------------------------------------------------------------------
		Обработчик прерываний от сигнала ri
  ---------------------------------------------------------------------------*/
void interrupt far ri_handle(void)
{
ri=1;
outpw(EOI,0xF);
}
